)ATTR                                                                           
  ~ TYPE(INPUT) INTENS(HIGH) CAPS(ON)                                           
  $ TYPE(TEXT)  INTENS(HIGH) CAPS(OFF) COLOR(TURQ)                              
  @ TYPE(OUTPUT) INTENS(LOW)                                                    
)BODY EXPAND(//)                                                                
%/-/ Mainframe Services Technical Workshop 2.0 | Miscellaneous /-/              
%Option ===>_ZCMD/ /                                                            
+ Select a menu option below+                                                   
+                                                                               
+$TRX     :_a+ * Team REXX lib          $PJOBS   :_g+ * Prod job datasets       
+$TPL     :_b+ * Team Panel lib         $Aliases :_h+ * P34 command aliases     
+$TSL     :_c+ * Team JCL Skeleton lib                                          
+                                                                               
+$MRX     :_d+ * My Rexx Lib                                                    
+$MPL     :_e+ * My Panel lib                                                   
+$MSL     :_f+ * My JCL Skeleton lib                                            
)INIT                                                                           
)PROC                                                                           
)END                                                                            
